<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [1]:
import pandas as pd
import psycopg2

In [2]:
# хороший тон при фиксации изменений в github не публиковать код с открытыми данными для входа
# для запуска кода поместите данные, которые указаны на странице курса в эту ячейку
# при размещении в github удалите эту ячейку

In [3]:
connection = psycopg2.connect(
   dbname=DBNAME,
   user=USER,
   host=HOST,
   password=PASSWORD,
   port=PORT
)

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

query_3_1 = f'''

'''

In [44]:
query_3_1 = f'''
select count(id)
from public.vacancies
'''

In [45]:
df = pd.read_sql_query(query_3_1, connection)
df

C:\Users\1\AppData\Local\Temp\ipykernel_10320\3851344990.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_1, connection)

   count
0  49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [46]:
query_3_2 = f'''
select count(id)
from public.employers

'''

In [47]:
df = pd.read_sql_query(query_3_2, connection)
df

C:\Users\1\AppData\Local\Temp\ipykernel_10320\3588252056.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_2, connection)

   count
0  23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [48]:
query_3_3 = f'''

select count(id)
from public.areas

'''

In [49]:
df = pd.read_sql_query(query_3_3, connection)
df

C:\Users\1\AppData\Local\Temp\ipykernel_10320\2018224393.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_3, connection)

   count
0   1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [50]:
query_3_4 = f'''

select count(id)
from public.industries

'''

In [51]:
df = pd.read_sql_query(query_3_4, connection)
df

C:\Users\1\AppData\Local\Temp\ipykernel_10320\2172479966.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_4, connection)

   count
0    294

***

Предварительные выводы. Перед нами общирная база данных в которой почти 300 сфер деятельности и более тысячи регионов. Вакансий в базе в 2 раза больше чем работодателей, это говорит, что в среднем у работодателей открыто по 2 вакансии.

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [82]:
query_4_1 = f'''

select 

a.name area,
count(v.id) cnt

from public.areas a

join public.vacancies v on a.id = v.area_id

group by a.name

order by 2 desc


'''

In [83]:
df = pd.read_sql_query(query_4_1, connection)
df

C:\Users\1\AppData\Local\Temp\ipykernel_10320\347208320.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_1, connection)

                area   cnt
0             Москва  5333
1    Санкт-Петербург  2851
2              Минск  2112
3        Новосибирск  2006
4             Алматы  1892
..               ...   ...
764       Тарко-Сале     1
765    Новоаннинский     1
766            Бирск     1
767           Сасово     1
768             Анна     1

[769 rows x 2 columns]

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [90]:
query_4_2 = f'''

select 

count(*)

from public.vacancies 

where salary_from is not null or salary_to is not null

'''

In [91]:
df = pd.read_sql_query(query_4_2, connection)
df

C:\Users\1\AppData\Local\Temp\ipykernel_10320\2168503709.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_2, connection)

   count
0  24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [98]:
query_4_3 = f'''

select 

round(avg(salary_from)),
round(avg(salary_to))

from public.vacancies 


'''

In [99]:
df = pd.read_sql_query(query_4_3, connection)
df

C:\Users\1\AppData\Local\Temp\ipykernel_10320\2222372203.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_3, connection)

     round     round
0  71065.0  110537.0

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [104]:
query_4_4 = f'''

select 

schedule,
employment,
count(id)

from public.vacancies 
group by 1, 2
order by 3 desc

'''

In [105]:
df = pd.read_sql_query(query_4_4, connection)
df

C:\Users\1\AppData\Local\Temp\ipykernel_10320\2981602351.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_4, connection)

            schedule           employment  count
0        Полный день     Полная занятость  35367
1   Удаленная работа     Полная занятость   7802
2      Гибкий график     Полная занятость   1593
3   Удаленная работа  Частичная занятость   1312
4     Сменный график     Полная занятость    940
5        Полный день           Стажировка    569
6     Вахтовый метод     Полная занятость    367
7        Полный день  Частичная занятость    347
8      Гибкий график  Частичная занятость    312
9        Полный день     Проектная работа    141
10  Удаленная работа     Проектная работа    133
11     Гибкий график           Стажировка    116
12    Сменный график  Частичная занятость    101
13  Удаленная работа           Стажировка     64
14     Гибкий график     Проектная работа     18
15    Сменный график           Стажировка     12
16    Вахтовый метод     Проектная работа      2
17    Сменный график     Проектная работа      1

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [111]:
query_4_5 = f'''

select 

experience,
count(id)

from public.vacancies 

group by experience

order by 2

'''

In [112]:
df = pd.read_sql_query(query_4_5, connection)
df

C:\Users\1\AppData\Local\Temp\ipykernel_10320\2601166264.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_5, connection)

           experience  count
0         Более 6 лет   1337
1           Нет опыта   7197
2       От 3 до 6 лет  14511
3  От 1 года до 3 лет  26152

***

In [ ]:
# Выводы по детальному анализу вакансий. 
# Чем крупнее город, тем больше в нем представлено вакансий.
# Ваансии в большинстве предлагают полную занятость.
# В большинстве случаев требуются специалисты с опытом.

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [123]:
query_5_1 = f'''

select 

e.name,
count(v.id)

from public.employers e
join public.vacancies v on e.id = v.employer_id

group by 1
order by 2 desc
limit 5


'''

In [124]:
df = pd.read_sql_query(query_5_1, connection)
df

C:\Users\1\AppData\Local\Temp\ipykernel_10320\1792814825.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_1, connection)

            name  count
0         Яндекс   1933
1     Ростелеком    491
2       Тинькофф    444
3           СБЕР    428
4  Газпром нефть    331

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [169]:
query_5_2 = f'''

select 

a.name,
count(e.name) count_employers


from public.areas a
left join public.vacancies v on a.id = v.area_id
left join public.employers e on a.id = e.area

group by a.id
having count(v.id) = 0
order by 2 desc




'''

In [170]:
df = pd.read_sql_query(query_5_2, connection)
df

C:\Users\1\AppData\Local\Temp\ipykernel_10320\3341481329.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_2, connection)

                             name  count_employers
0                          Россия              410
1                       Казахстан              207
2              Московская область               75
3              Краснодарский край               19
4                        Беларусь               18
..                            ...              ...
588  Лиман (Астраханская область)                0
589                       Хоринск                0
590                       Старица                0
591                  Ессентукская                0
592                  Нижняя Салда                0

[593 rows x 2 columns]

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [195]:
query_5_3 = f'''

select distinct
count(v.area_id),
e.name


from public.employers e
join public.vacancies v on e.id = v.employer_id

group by e.id
order by 1 desc




'''

In [196]:
df = pd.read_sql_query(query_5_3, connection)
df

C:\Users\1\AppData\Local\Temp\ipykernel_10320\2398953733.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_3, connection)

       count                                name
0       1933                              Яндекс
1        491                          Ростелеком
2        444                            Тинькофф
3        428                                СБЕР
4        331                       Газпром нефть
...      ...                                 ...
14842      1  Ярославский судостроительный завод
14843      1            Ярославский филиал ПГУПС
14844      1             Ясли-сад №374 г. Минска
14845      1                   Ястро-Переработка
14846      1                                ЯТСС

[14847 rows x 2 columns]

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [212]:
query_5_4 = f'''

select distinct
count(e.name)


from public.employers e
left join public.employers_industries ei on e.id = ei.employer_id
where ei.industry_id is null


'''

In [213]:
df = pd.read_sql_query(query_5_4, connection)
df

C:\Users\1\AppData\Local\Temp\ipykernel_10320\3114411492.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_4, connection)

   count
0   8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [227]:
query_5_5 = f'''

select distinct
e.name,
count(ei.industry_id)



from public.employers e
left join public.employers_industries ei on e.id = ei.employer_id
group by e.id
having count(ei.industry_id) = 4
order by 1
offset 2 limit 1


'''

In [228]:
df = pd.read_sql_query(query_5_5, connection)
df

C:\Users\1\AppData\Local\Temp\ipykernel_10320\1650419958.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_5, connection)

   name  count
0  2ГИС      4

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [41]:
query_5_6 = f'''

select distinct
count(e.employer_id)

from public.employers_industries e
left join industries i on i.id = e.industry_id 
where i.name = 'Разработка программного обеспечения'

'''

In [43]:
df = pd.read_sql_query(query_5_6, connection)
df

C:\Users\1\AppData\Local\Temp\ipykernel_14280\1169039133.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_6, connection)

   count
0   3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [18]:
big_city = (
    "Москва", "Санкт-Петербург", "Новосибирск", 
    "Екатеринбург", "Казань", "Нижний Новгород", 
    "Красноярск", "Челябинск", "Самара", "Уфа", 
    "Ростов-на-Дону", "Омск", "Краснодар", 
    "Воронеж", "Пермь", "Волгоград"
)

query_5_7 = f'''
(SELECT 
a.name,
count(*) cnt
from employers e
join vacancies v on e.id = v.employer_id
join areas a on a.id = v.area_id
WHERE e.name = 'Яндекс' and a.name in {big_city}
GROUP BY a.id
ORDER BY 2 ASC)
            
UNION ALL 

(SELECT 
'TOTAL',
COUNT (*) "Общ кол-во вакансий в городах-миллионниках"
FROM public.vacancies v
JOIN public.employers e ON e.id = v.employer_id
JOIN public.areas a ON a.id = v.area_id
WHERE e.name = 'Яндекс' and a.name in {big_city})            

'''

In [19]:
df = pd.read_sql_query(query_5_7, connection)
df

C:\Users\1\AppData\Local\Temp\ipykernel_7980\3129374555.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_7, connection)

               name  cnt
0             TOTAL  485
1              Омск   21
2         Челябинск   22
3        Красноярск   23
4         Волгоград   24
5    Ростов-на-Дону   25
6            Казань   25
7             Пермь   25
8            Самара   26
9               Уфа   26
10        Краснодар   30
11          Воронеж   32
12      Новосибирск   35
13  Нижний Новгород   36
14     Екатеринбург   39
15  Санкт-Петербург   42
16           Москва   54

***

In [ ]:
# Выводы по анализу работодателей. 
# Больше всего вакансий у крупных, узнаваемых компаний, которые входят в ММВБ. 
# Лидером по количеству вакансий является Яндекс.
# Эти же компании являются лидерами по количеству вакансий, представленных в различных регионах.

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [6]:
query_6_1 = f'''

select count (*) "data вакансии" 
from public.vacancies v 
where v.name ILIKE '%data%' OR v.name ILIKE '%данн%' OR v.name ILIKE '%Data%' OR v.name ILIKE '%Данн%'

'''

In [7]:
df = pd.read_sql_query(query_6_1, connection)
df

C:\Users\1\AppData\Local\Temp\ipykernel_17000\485020324.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_1, connection)

   data вакансии
0           1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [45]:
query_6_2 = f'''

select count (*) "data вакансии" 
from public.vacancies v 
WHERE
    (
    (name ILIKE '%data scientist%') 
    OR (name ILIKE '%data science%') 
    OR (name ILIKE '%исследователь данных%')
    OR ((name LIKE '%ML%') AND (name NOT ILIKE '%HTML%'))
    OR (name ILIKE '%machine learning%')
    OR (name ILIKE '%машинн%обучен%')
    )
    AND 
    (
    (v.name ILIKE '%junior%')
    OR (v.experience ILIKE '%Нет опыта%') 
    OR (v.employment ILIKE '%Стажировка%')
    )

'''

In [46]:
df = pd.read_sql_query(query_6_2, connection)
df

C:\Users\1\AppData\Local\Temp\ipykernel_17000\3641650667.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_2, connection)

   data вакансии
0             51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [43]:
query_6_3 = f'''

select count (*) "data вакансии" 
from public.vacancies v 
WHERE
    (
    (name ILIKE '%data scientist%') 
    OR (name ILIKE '%data science%') 
    OR (name ILIKE '%исследователь данных%')
    OR ((name LIKE '%ML%') AND (name NOT ILIKE '%HTML%'))
    OR (name ILIKE '%machine learning%')
    OR (name ILIKE '%машинн%обучен%')
    )
AND 
    (
    key_skills ILIKE '%SQL%' 
    OR
    key_skills ILIKE '%postgres%'  
    )

'''

In [44]:
df = pd.read_sql_query(query_6_3, connection)
df

C:\Users\1\AppData\Local\Temp\ipykernel_17000\1159587760.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_3, connection)

   data вакансии
0            201

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [47]:
query_6_4 = f'''

select count (*) "data вакансии" 
from public.vacancies v 
WHERE
    (
    (name ILIKE '%data scientist%') 
    OR (name ILIKE '%data science%') 
    OR (name ILIKE '%исследователь данных%')
    OR ((name LIKE '%ML%') AND (name NOT ILIKE '%HTML%'))
    OR (name ILIKE '%machine learning%')
    OR (name ILIKE '%машинн%обучен%')
    )
AND 
    (
    key_skills ILIKE '%Python%' 
    )

'''

In [48]:
df = pd.read_sql_query(query_6_4, connection)
df

C:\Users\1\AppData\Local\Temp\ipykernel_17000\972386973.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_4, connection)

   data вакансии
0            351

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [57]:
query_6_5 = f'''

SELECT 
ROUND
(
AVG(length(key_skills) - length(REPLACE(key_skills, CHR(9), '' ))+1), 2 
)
FROM public.vacancies

WHERE
    (
    (name ILIKE '%data scientist%') 
    OR (name ILIKE '%data science%') 
    OR (name ILIKE '%исследователь данных%')
    OR ((name LIKE '%ML%') AND (name NOT ILIKE '%HTML%'))
    OR (name ILIKE '%machine learning%')
    OR (name ILIKE '%машинн%обучен%')
    )

'''

In [58]:
df = pd.read_sql_query(query_6_5, connection)
df

C:\Users\1\AppData\Local\Temp\ipykernel_17000\390248827.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_5, connection)

   round
0   6.41

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [83]:
query_6_6 = f'''

    SELECT
    experience,
    ROUND(AVG(COALESCE(((salary_from + salary_to)/2), salary_from, salary_to, 0)))
    FROM public.vacancies
    WHERE ((name ILIKE '%data scientist%') 
    OR (name ILIKE '%data science%')  
    OR (name ILIKE '%исследователь данных%')    
    OR ((name LIKE '%ML%') 
    AND (name NOT ILIKE '%HTML%')) 
    OR (name ILIKE '%machine learning%') 
    OR (name ILIKE '%машинн%обучен%') 
    AND (key_skills IS NOT NULL))
      
    AND ((salary_from IS NOT NULL) OR (salary_to IS NOT NULL))
    AND (experience ILIKE '%от 3 до 6 лет%')  
                                                                                                                                                                                                                                  
    GROUP BY experience 
    
'''

In [84]:
df = pd.read_sql_query(query_6_6, connection)
df

C:\Users\1\AppData\Local\Temp\ipykernel_17000\3561045109.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_6, connection)

      experience     round
0  От 3 до 6 лет  243115.0

***

In [ ]:
# выводы по предметному анализу
# вакансии связанные с обработкой данных можно назвать восстребованными
# при этомв подавляющем большинстве вакансий требуется наличие опыта
# Python и SQL являются одними из ключевых навыков при работе с данными и встречаются в 19% и 11% вакансий соответственно
# Опытные специалисты в DS получают хорошую ЗП выше средней

# Общий вывод по проекту

In [ ]:
# подведем итог исследования, обобщите выводы
# чем более крупный город, тем больше вакансий там обычно представлено
# крупнейшие работодатели - это компании из списка ММВБ (Яндекс, Ростелеком, Тинькофф, СБЕР и тд.)
# большинсвто соискателей ищет работу с полной занятостью
# направление DS выглядит привлекательно для соискательей за счет высокой ЗП, но соискатели без опыта могут столкнуться с трудностями при трудоустройстве, т.к. в данном направлении в подавляющем большинстве вакансий он требуется